app/Controllers/UserPageController.php

SELECT `picture`
FROM `cars`
ORDER BY RAND()
SELECT *
FROM `cars`
---
    public function index()
    {


        $carModel = new CarModel();
        // Retrieve car data from the database

        $randomPictures = $carModel
            ->select('picture')
            ->orderBy('RAND()')
            ->limit(5)
            ->findAll();

        $cars = $carModel->findAll();